# 1번_B735042_김대겸

# birthReader()선언.
def birthReader(x):
    month30 = ["04", "06", "09", "11"] # 총 일수가 30일인 달
    month31 = ["01", "03", "05", "07", "08", "10", "12"] # 총 일수가 31인 달
    date30 = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10",
            "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
            "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"]
    date31 = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", 
            "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
            "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31"]
    date28 = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", # 평년일때 2월
            "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
            "21", "22", "23", "24", "25", "26", "27", "28"]
    
    # 입력된 생년월일이 8자리인지 확인.
    if len(x) == 8:
        # 2월일 경우 윤년인지 확인.        
        if  x[4:6] == "02":
            if int(x[0:4]) % 4 == 0: # 윤년일때
                if (x[6:]) in (date28 + list("29")):
                    return True 
                if int(x[0:4]) % 100 == 0: # 평년일때
                    if (x[6:]) in date28:
                        return True
            else: #평년일때
                if (x[6:]) in date28:
                    return True
        elif x[4:6] in month30: # 일수가 30일인 월일때
            if x[6:] in date30:
                return True
        elif x[4:6] in month31: # 일수가 31일인 월일때
            if x[6:] in date31:
                return True

# 사용자로부터 생년월일 입력받음.                
birth = input("생년월일을 입력하시오 : ")

# 결과 출력
if birthReader(birth) == True:
    print("올바른 생년월일입니다.")
else:
    print("올바르지 않은 생년월일입니다.")
            
